In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df= sns.load_dataset('titanic')

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [7]:
df.shape

(891, 15)

In [8]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [9]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
df.isnull().sum().sum()

869

In [15]:
df.isnull().any(axis=1).sum()  ## count of rows with any null values

709

In [17]:
missing_cols= df.columns[df.isna().any()].tolist()
print(missing_cols)

['age', 'embarked', 'deck', 'embark_town']

In [18]:
df.duplicated().sum()

107

In [19]:
df.drop_duplicates(inplace=True)

In [21]:
df.shape

(784, 15)

In [22]:
df.duplicated().sum()  ## check for duplicate rows

0

In [23]:
df.reset_index(drop=True, inplace=True)

In [24]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            106
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           582
embark_town      2
alive            0
alone            0
dtype: int64

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     784 non-null    int64
 1   pclass       784 non-null    int64
 2   sex          784 non-null    object
 3   age          678 non-null    float64
 4   sibsp        784 non-null    int64
 5   parch        784 non-null    int64
 6   fare         784 non-null    float64
 7   embarked     782 non-null    object
 8   class        784 non-null    category
 9   who          784 non-null    object
 10  adult_male   784 non-null    bool
 11  deck         202 non-null    category
 12  embark_town  782 non-null    object
 13  alive        784 non-null    object
 14  alone        784 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 71.0+ KB

In [26]:
df['age_mean']= df['age'].fillna(df['age'].mean())

In [27]:
df[['age', 'age_mean']].head(10)

    age   age_mean
0  22.0  22.000000
1  38.0  38.000000
2  26.0  26.000000
3  35.0  35.000000
4  35.0  35.000000
5   NaN  29.869351
6  54.0  54.000000
7   2.0   2.000000
8  27.0  27.000000
9  14.0  14.000000

In [28]:
df['age_median']= df['age'].fillna(df['age'].median())

In [29]:
df[['age','age_median']]

      age  age_median
0    22.0       22.00
1    38.0       38.00
2    26.0       26.00
3    35.0       35.00
4    35.0       35.00
..    ...         ...
779  39.0       39.00
780  19.0       19.00
781   NaN       28.25
782  26.0       26.00
783  32.0       32.00

[784 rows x 2 columns]

In [30]:
df.head(20)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,age_median
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22.000000,22.00
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38.000000,38.00
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26.000000,26.00
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35.000000,35.00
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35.000000,35.00
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,29.869351,28.25
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,54.000000,54.00
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,2.000000,2.00
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,27.000000,27.00
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,14.000000,14.00
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False,4.000000,4.00
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True,58.000000,58.00
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,20.000000,20.00
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False,39.000000,39.00
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True,14.000000,14.00
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True,55.000000,55.00
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False,2.000000,2.00
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,29.869351,28.25
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False,31.000000,31.00
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,29.869351,28.25

In [ ]:
df.drop(columns=['age'], inplace=True) ## dropoing the original age column

KeyError: "['age'] not found in axis"

In [32]:
df.head()

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,age_median
0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22.0,22.0
1,1,1,female,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38.0,38.0
2,1,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26.0,26.0
3,1,1,female,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35.0,35.0
4,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35.0,35.0

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 784 entries, 0 to 783
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     784 non-null    int64
 1   pclass       784 non-null    int64
 2   sex          784 non-null    object
 3   sibsp        784 non-null    int64
 4   parch        784 non-null    int64
 5   fare         784 non-null    float64
 6   embarked     782 non-null    object
 7   class        784 non-null    category
 8   who          784 non-null    object
 9   adult_male   784 non-null    bool
 10  deck         202 non-null    category
 11  embark_town  782 non-null    object
 12  alive        784 non-null    object
 13  alone        784 non-null    bool
 14  age_mean     784 non-null    float64
 15  age_median   784 non-null    float64
dtypes: bool(2), category(2), float64(3), int64(4), object(5)
memory usage: 77.2+ KB

In [36]:
df['embarked'].value_counts()

embarked
S    568
C    155
Q     59
Name: count, dtype: int64

In [39]:
df[df['embarked'].isnull()]

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,age_median
60,1,1,female,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True,38.0,38.0
734,1,1,female,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True,62.0,62.0

In [42]:
df['embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [45]:
mode_value= df[df['embarked'].notna()]['embarked'].mode()[0]

In [47]:
df['embarked'].fillna(mode_value, inplace= True)

In [50]:
df['embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [54]:
df[df['embarked'].isnull()]

Empty DataFrame
Columns: [survived, pclass, sex, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone, age_mean, age_median]
Index: []

In [55]:
df.isna().sum()

survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           582
embark_town      2
alive            0
alone            0
age_mean         0
age_median       0
dtype: int64

In [56]:
df.head()

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,age_median
0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22.0,22.0
1,1,1,female,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38.0,38.0
2,1,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26.0,26.0
3,1,1,female,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35.0,35.0
4,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35.0,35.0

In [57]:
df[df['embark_town'].isna()]

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,age_median
60,1,1,female,0,0,80.0,S,First,woman,False,B,NaN,yes,True,38.0,38.0
734,1,1,female,0,0,80.0,S,First,woman,False,B,NaN,yes,True,62.0,62.0

In [58]:
df['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [59]:
df['embark_town'].value_counts()

embark_town
Southampton    568
Cherbourg      155
Queenstown      59
Name: count, dtype: int64

In [60]:
embark_town_mode= df[df['embark_town'].notna()]['embark_town'].mode()[0]

In [61]:
df['embark_town'].fillna(embark_town_mode, inplace=True )

In [62]:
df.isna().sum()

survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           582
embark_town      0
alive            0
alone            0
age_mean         0
age_median       0
dtype: int64

In [63]:
df['deck'].unique()

[NaN, 'C', 'E', 'G', 'D', 'A', 'B', 'F']
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [64]:
df['deck'].value_counts()

deck
C    59
B    46
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

In [79]:
df['deck']=df['deck'].cat.add_categories(['U']).fillna('U',inplace=True)  ## filling missing values with 'U' for Unknown

AttributeError: Can only use .cat accessor with a 'category' dtype

Series([], Name: count, dtype: int64)

In [80]:
df.isnull().sum()

survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           784
embark_town      0
alive            0
alone            0
age_mean         0
age_median       0
dtype: int64

In [81]:
df['deck'].unique()

array([None], dtype=object)

In [82]:
df.head()

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,age_median
0,0,3,male,1,0,7.2500,S,Third,man,True,None,Southampton,no,False,22.0,22.0
1,1,1,female,1,0,71.2833,C,First,woman,False,None,Cherbourg,yes,False,38.0,38.0
2,1,3,female,0,0,7.9250,S,Third,woman,False,None,Southampton,yes,True,26.0,26.0
3,1,1,female,1,0,53.1000,S,First,woman,False,None,Southampton,yes,False,35.0,35.0
4,0,3,male,0,0,8.0500,S,Third,man,True,None,Southampton,no,True,35.0,35.0

In [84]:
df['deck'].dtype

dtype('O')